W4D5/music_app/app/controllers/albums_controller.rb

  def new
    @album = Album.new
    @band_id = Band.find(params[:band_id]).id
---
SELECT  "bands".* FROM "bands" WHERE "bands"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

  def create
    @album = Album.new(album_params)
    fail
    if @album.save
---
INSERT INTO "albums" ("band_id", "title", "yr", "live", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["band_id", 1], ["title", "Album 1"], ["yr", 1995], ["live", true], ["created_at", "2018-11-16 01:27:12.038814"], ["updated_at", "2018-11-16 01:27:12.038814"]]