W4D5/music_app/app/controllers/sessions_controller.rb

  def create
    @user = User.find_by_credentials(params[:user][:email], params[:user][:password])

    if @user && @user.save
---
UPDATE "users" SET "session_token" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["session_token", "vcH-0F8PuxQELinhCMp9DQ"], ["updated_at", "2018-11-15 22:02:43.624294"], ["id", 1]]